Table of Contents
 Class Tools
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
public static class Tools
Inheritance
object
Tools
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Methods
 ConnectionDataFromXml(string)
Deserialize ConnectionData from xml
public static ConnectionData ConnectionDataFromXml(string xml)
Parameters
xml string
Returns
ConnectionData
 ConnectionDataToXml(ConnectionData)
Serialize ConnectionData to xml
public static string ConnectionDataToXml(ConnectionData model)
Parameters
model ConnectionData
Returns
string
 DeserializeModelFromFile<T>(string)
Creates the instance from the XML file
public static T DeserializeModelFromFile<T>(string xmlFileName)
Parameters
xmlFileName string
XML file name
Returns
T
Deserialize instance model
Type Parameters
T
 DeserializeModelFromStream<T>(Stream)
Deserialize Model from stream
public static T DeserializeModelFromStream<T>(Stream stream)
Parameters
stream Stream
Returns
T
Deserialize instance model
Type Parameters
T
 DeserializeModel<T>(string)
Deserialize Model
public static T DeserializeModel<T>(string xml)
Parameters
xml string
Serialize model in string
Returns
T
Deserialize instance model
Type Parameters
T
Type of model
 OpenModelContainerFromFile(string)
Deserialize OpenModelContainer from file
public static OpenModelContainer OpenModelContainerFromFile(string filePath)
Parameters
filePath string
Returns
OpenModelContainer
 OpenModelContainerFromXml(string)
Deserialize OpenModelContainer from Xml
public static OpenModelContainer OpenModelContainerFromXml(string xml)
Parameters
xml string
Returns
OpenModelContainer
 OpenModelContainerToFile(OpenModelContainer, string)
Serialize OpenModelContainer to File
public static void OpenModelContainerToFile(OpenModelContainer model, string filePath)
Parameters
model OpenModelContainer
filePath string
 OpenModelContainerToXml(OpenModelContainer)
Serialize OpenModelContainer to Xml
public static string OpenModelContainerToXml(OpenModelContainer model)
Parameters
model OpenModelContainer
Returns
string
 SerializeModelToFile<T>(T, string)
Serialize Model
public static void SerializeModelToFile<T>(T model, string filePath)
Parameters
model T
instance of model
filePath string
File path
Type Parameters
T
Type of model
 SerializeModel<T>(T)
Serialize Model
public static string SerializeModel<T>(T model)
Parameters
model T
instance of model
Returns
string
Serialize model in string
Type Parameters
T
Type of model
 Edit this page